[{
  "homePage":
    {"skillSet":[
      {"skill":"AngularJS", "value": 80},
      {"skill":"Angular", "value": 40},
      {"skill":"Core JAVA", "value": 75},
      {"skill":"JavaScript", "value": 70},
      {"skill":"SQL", "value": 50},
      {"skill":"RESTful APIs", "value": 65},
      {"skill":"HTML", "value": 90},
      {"skill":"CSS", "value": 85},
      {"skill":"JSPs & Servlets", "value": 45}]},
  "experiencePage":
    {"epitome":"My professional work experience includes front-end development (AngularJS, Angular), back-end development (Java 8- Servlets, JSPs) and Database (Microsoft SQL Server). In various capacities in software development for BPM (Business process management) for the clients of Newgen Softwares Tech. Ltd., working with different projects, I have acquired skills in numerous phases of software development process including responsive UIs, consuming SOAP APIs, designing REST API, client side and server side coding as well as Database queries.",
     "experienceList":[{"duration":"July 2017 - Present",
                       "company":"Newgen software Technologies Ltd",
                       "place":"Noida, India",
                       "subDurationList":[{"subDuration":"July 2019-Present : (Web Application Development)",
                                           "tagLine":"Currently working on the development of web portal to digitize business loan applications of a US based bank. This portal is inspired by the previous similar project that I worked on which attracted this current potential client for the company.",
                                           "bulletPoints":["Worked on the GUI development using MVC architecture of AngularJS to create a SPA (Single Page Application) portal.",
                                                           "Used AngularJS routing feature to navigate between various templates (views and controllers) represented by their individual states.",
                                                           "Worked with JSPs in order to integrate with the SOAP APIs provided to make connection with DB for data manipulation (saving, fetching, modifying)."]},
                                          {"subDuration":"May 2019-July 2019 : (Multithreaded programming for developing Utility)",
                                           "tagLine":"Created a Utility in JAVA for Transaction settlement processes.",
                                           "bulletPoints":["Using JAVA's multi-threading property, created multiple parallel threads to concurrently monitor and process settlement of transactions initiated by the Payment Gateway WebService.",
                                                           "The task of threads is to settle approved transactions and then to process balance transfer for settled transactions."]},
                                          {"subDuration":"January 2019-May 2019 : (RESTful WebService Development)",
                                           "tagLine":"Developed a common Payment Gateway WebService to integrate with the Enterprise Payment Solutions provided by JHA which could be used internally with different projects of Newgen.",
                                           "bulletPoints":["Developed GUI and RESTful WebService using Jersey 2.x and Maven build tool.",
                                                           "Consumed SOAP web services provided for transaction processing by JHA to ensure secure payment through credit/debit card.",
                                                           "Using SQL Server created DB Scripts, Procedures and Functions to securely keep track of each transaction's data."]},
                                          {"subDuration":"October 2017-January 2019 : (Web Application Development)",
                                           "tagLine":"Developed a Loan Application Portal for the end customers of US based bank.",
                                           "bulletPoints":["Worked on GUI development using MVC architecture of AngularJS.",
                                                           "Developed a responsive SPA(Single Page Application) web portal using AngularJS material and AngularJS framework's features along with jQuery and custom CSS styling to tackle the issue of cross-browser compatibility.",
                                                           "Used Java Socket Programming for connection between different servers and integration with different APIs/Web Services.",
                                                           "Worked with SQL Server to create DB Scripts, Procedures, Triggers and Functions for securely storing, manipulating and handling sensitive data of Bank.",
                                                           "Worked with Java Servlets to handle http requests, collect and consume input from users through web forms of portal, present records from database, and for various other server side functionalities.",
                                                           "Used SVN for versioning and revision control of source code and other files.",
                                                           "Took hands-on experience in working with the Eclipse IDE for Java EE web application.",
                                                           "Developed a consolidated logical dashboard that can display a list of loan applications to the banker and each application is a link to the portal containing corresponding customer's information."]},
                                          {"subDuration":"July 2017-October 2017 : (Web Application Development)",
                                           "tagLine":"Contributed in developing both client-side and server-side web application portal for mobile/desktop, which provided a channel for the prospective customers of the Bank to apply for loans.",
                                           "bulletPoints":[]}]
                            }]},
  "projectPage":
    {"heading":"My Projects",
      "projectList":[{"projectCode":"UB",
                      "imagePath":"./assets/images/projects/01.jpg",
                      "projectName":"Bank Portal to digitize Business Loan Application",
                      "category":"Business Process Management"}]},
  "projectDialog":
    {"UB":{"name":["Customer Loan Application", "Portal & Loan Monitoring"],
                         "abstract":{"epitome":["This Business Loan Portal is for a US centric bank to digitiz the business loan application process and seamlessly pass the same to the business loan origination system for streamlined processing.",
                                                "The key objective is to automate Business Loan Origination, Processing, and capture leads via the Business Loan Portal while accommodating all of Bank’s product offerings listed and agreed in  scope of work. The solution enables faster application time. This will allow the Bank to capture more business loan leads and increase market-share from competitors’ business. Some key features of the solution are:"],
                                     "bullets":["User-friendly business loan online application to optimize lead capture.",
                                                "Improved efficiency in data capture and reduction in turnaround-time (TAT). For instance, the system will capture details from all borrowers and provide contact details to Bank for follow up.",
                                                "A secure system that protects the confidentiality, availability and integrity of business member information throughout the process, while stored and in transit.",
                                                "Easy to use graphical user interface (GUI) and dynamic application fields based on business loan product"]},
                          "technologies":{"epitome":["The portal is a Single Page Application(SPA) based on MVC(Model View Controller) architecture.",
                                                     "The list of Technologies/tools/methodologies used is:"],
                                          "list":["AngularJS", "jQuery", "JAVA", "Servlets", "Java Socket Programming", "Multi-threading", "API integrations",
                                                  "SQL Server (DB procedures, scripts, functions, triggers)", "SVN", "JBoss", "Eclipse IDE", "Sonar Lint"]}}}
  }]